Hybrid-Memcached/ex2_result/memtier_2t_16t_default_datasize_946_cycle_100_result
16        Threads
50        Connections per thread
120       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        25445.88          ---          ---        30.90033        31.48700        50.43100        66.04700     24551.30 
Gets           20.00        20.00         0.00        31.16615        31.61500        46.33500        66.55900        19.70 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      25465.88        20.00         0.00        30.90054        31.48700        50.43100        66.04700     24571.01 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.319        0.000
SET      24.703        5.000
SET      25.599       10.000
SET      26.111       15.000
SET      26.623       20.000
SET      27.135       25.000
SET      28.031       30.000
SET      29.311       35.000
SET      30.463       40.000
SET      31.103       45.000
SET      31.487       50.000
SET      31.615       52.500
SET      31.871       55.000
SET      31.999       57.500
SET      32.127       60.000
SET      32.255       62.500
SET      32.383       65.000
SET      32.639       67.500
SET      32.767       70.000
SET      33.023       72.500
SET      33.279       75.000
SET      33.279       76.250
SET      33.535       77.500
SET      33.535       78.750
SET      33.791       80.000
SET      34.047       81.250
SET      34.303       82.500
SET      34.559       83.750
SET      34.815       85.000
SET      35.071       86.250
SET      35.327       87.500
SET      35.583       88.125
SET      35.583       88.750
SET      35.839       89.375
SET      35.839       90.000
SET      36.095       90.625
SET      36.351       91.250
SET      36.351       91.875
SET      36.607       92.500
SET      36.863       93.125
SET      37.119       93.750
SET      37.119       94.062
SET      37.375       94.375
SET      37.631       94.688
SET      37.887       95.000
SET      38.143       95.312
SET      38.399       95.625
SET      38.911       95.938
SET      39.167       96.250
SET      39.679       96.562
SET      39.935       96.875
SET      40.191       97.031
SET      40.447       97.188
SET      40.703       97.344
SET      40.959       97.500
SET      41.471       97.656
SET      41.983       97.812
SET      42.495       97.969
SET      42.751       98.125
SET      43.519       98.281
SET      44.031       98.438
SET      44.543       98.516
SET      45.055       98.594
SET      45.567       98.672
SET      46.335       98.750
SET      47.359       98.828
SET      48.639       98.906
SET      50.175       98.984
SET      51.455       99.062
SET      52.479       99.141
SET      52.991       99.219
SET      53.247       99.258
SET      53.503       99.297
SET      53.759       99.336
SET      54.015       99.375
SET      54.015       99.414
SET      54.271       99.453
SET      54.527       99.492
SET      54.527       99.531
SET      54.783       99.570
SET      55.295       99.609
SET      55.551       99.629
SET      55.807       99.648
SET      56.063       99.668
SET      56.319       99.688
SET      56.575       99.707
SET      57.087       99.727
SET      57.855       99.746
SET      58.623       99.766
SET      59.135       99.785
SET      60.159       99.805
SET      60.671       99.814
SET      61.183       99.824
SET      61.695       99.834
SET      62.207       99.844
SET      62.719       99.854
SET      62.975       99.863
SET      63.743       99.873
SET      64.255       99.883
SET      65.023       99.893
SET      66.047       99.902
SET      66.559       99.907
SET      67.071       99.912
SET      67.583       99.917
SET      68.095       99.922
SET      69.631       99.927
SET      71.167       99.932
SET      73.215       99.937
SET      76.799       99.941
SET      81.919       99.946
SET      91.135       99.951
SET      96.767       99.954
SET     100.863       99.956
SET     102.911       99.958
SET     104.447       99.961
SET     107.007       99.963
SET     108.543       99.966
SET     109.567       99.968
SET     110.079       99.971
SET     110.591       99.973
SET     111.103       99.976
SET     111.103       99.977
SET     111.103       99.978
SET     111.615       99.979
SET     111.615       99.980
SET     113.151       99.982
SET     113.663       99.983
SET     114.687       99.984
SET     115.199       99.985
SET     116.223       99.987
SET     117.247       99.988
SET     117.759       99.988
SET     118.271       99.989
SET     119.295       99.990
SET     120.319       99.990
SET     120.831       99.991
SET     121.343       99.991
SET     122.879       99.992
SET     123.903       99.993
SET     124.927       99.993
SET     126.975       99.994
SET     129.535       99.994
SET     132.095       99.995
SET     140.287       99.995
SET     142.335       99.995
SET     142.335       99.995
SET     148.479       99.996
SET     204.799       99.996
SET     262.143       99.996
SET     311.295       99.997
SET     372.735       99.997
SET     405.503       99.997
SET     442.367       99.997
SET     468.991       99.997
SET     507.903       99.998
SET     536.575       99.998
SET     565.247       99.998
SET     606.207       99.998
SET     634.879       99.998
SET     663.551       99.998
SET     704.511       99.998
SET     720.895       99.999
SET     737.279       99.999
SET     753.663       99.999
SET     765.951       99.999
SET     794.623       99.999
SET     806.911       99.999
SET     823.295       99.999
SET     843.775       99.999
SET     860.159       99.999
SET     876.543       99.999
SET     884.735       99.999
SET     897.023       99.999
SET     905.215       99.999
SET     913.407       99.999
SET     921.599       99.999
SET     929.791       99.999
SET     937.983      100.000
SET     954.367      100.000
SET     962.559      100.000
SET     970.751      100.000
SET     970.751      100.000
SET     978.943      100.000
SET     983.039      100.000
SET     983.039      100.000
SET     995.327      100.000
SET     995.327      100.000
SET     999.423      100.000
SET    1011.711      100.000
SET    1011.711      100.000
SET    1019.903      100.000
SET    1019.903      100.000
SET    1019.903      100.000
SET    1023.999      100.000
SET    1023.999      100.000
SET    1023.999      100.000
[...]
SET    1028.095      100.000
SET    1028.095      100.000
SET    1028.095      100.000
[...]
SET    1036.287      100.000
SET    1036.287      100.000
SET    1036.287      100.000
[...]
SET    1044.479      100.000
SET    1044.479      100.000
---
GET      13.567        0.000
GET      25.215        5.000
GET      25.599       10.000
GET      26.111       15.000
GET      26.367       20.000
GET      26.879       25.000
GET      27.519       30.000
GET      30.207       35.000
GET      30.847       40.000
GET      31.231       45.000
GET      31.615       50.000
GET      31.743       52.500
GET      31.999       55.000
GET      32.127       57.500
GET      32.255       60.000
GET      32.511       62.500
GET      32.767       65.000
GET      33.023       67.500
GET      33.535       70.000
GET      33.535       72.500
GET      34.047       75.000
GET      34.047       76.250
GET      34.303       77.500
GET      34.559       78.750
GET      34.559       80.000
GET      34.815       81.250
GET      35.071       82.500
GET      35.327       83.750
GET      35.583       85.000
GET      35.583       86.250
GET      35.839       87.500
GET      35.839       88.125
GET      36.095       88.750
GET      36.095       89.375
GET      36.095       90.000
GET      36.351       90.625
GET      36.351       91.250
GET      36.607       91.875
GET      36.607       92.500
GET      36.863       93.125
GET      36.863       93.750
GET      36.863       94.062
GET      37.119       94.375
GET      37.119       94.688
GET      37.375       95.000
GET      37.887       95.312
GET      38.143       95.625
GET      38.399       95.938
GET      38.911       96.250
GET      39.423       96.562
GET      40.191       96.875
GET      40.447       97.031
GET      40.703       97.188
GET      40.703       97.344
GET      40.959       97.500
GET      41.215       97.656
GET      41.727       97.812
GET      41.983       97.969
GET      42.239       98.125
GET      42.495       98.281
GET      43.519       98.438
GET      43.775       98.516
GET      43.775       98.594
GET      44.287       98.672
GET      44.287       98.750
GET      44.543       98.828
GET      44.799       98.906
GET      46.335       98.984
GET      46.335       99.062
GET      46.591       99.141
GET      46.847       99.219
GET      46.847       99.258
GET      47.871       99.297
GET      48.383       99.336
GET      48.383       99.375
GET      48.639       99.414
GET      53.503       99.453
GET      53.503       99.492
GET      53.503       99.531
GET      53.503       99.570
GET      53.759       99.609
GET      53.759       99.629
GET      53.759       99.648
GET      55.295       99.668
GET      55.295       99.688
GET      55.295       99.707
GET      56.063       99.727
GET      56.063       99.746
GET      58.111       99.766
GET      58.111       99.785
GET      58.367       99.805
GET      58.367       99.814
GET      58.367       99.824
GET      61.695       99.834
GET      61.695       99.844
GET      61.695       99.854
GET      61.695       99.863
GET      61.695       99.873
GET      66.559       99.883
GET      66.559       99.893
GET      66.559       99.902
GET      66.559       99.907
GET      66.559       99.912
GET      67.583       99.917
GET      67.583       99.922
GET      67.583       99.927
GET      67.583       99.932
GET      67.583       99.937
GET      67.583       99.941
GET      67.583       99.946
GET      67.583       99.951
GET      67.583       99.954
GET      67.583       99.956
GET     142.335       99.958
GET     142.335      100.000
---
WAIT      0.000      100.000